MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAM4LC4CA/mcu.h
#define PDCA              ((Pdca     *)0x400A2000UL) /**< \brief (PDCA) APB Base Address */
#define PDCA_ADDR                     (0x400A2000UL) /**< \brief (PDCA) APB Base Address */
#define PDCA_INST_NUM     1                          /**< \brief (PDCA) Number of instances */
#define PDCA_INSTS        { PDCA }                   /**< \brief (PDCA) Instances List */

#define PEVC              ((Pevc     *)0x400A6000UL) /**< \brief (PEVC) APB Base Address */
#define PEVC_ADDR                     (0x400A6000UL) /**< \brief (PEVC) APB Base Address */
#define PEVC_INST_NUM     1                          /**< \brief (PEVC) Number of instances */
#define PEVC_INSTS        { PEVC }                   /**< \brief (PEVC) Instances List */

#define PICOUART          ((Picouart *)0x400F1400UL) /**< \brief (PICOUART) APB Base Address */
#define PICOUART_ADDR                 (0x400F1400UL) /**< \brief (PICOUART) APB Base Address */
#define PICOUART_INST_NUM 1                          /**< \brief (PICOUART) Number of instances */
#define PICOUART_INSTS    { PICOUART }               /**< \brief (PICOUART) Instances List */

#define PM                ((Pm       *)0x400E0000UL) /**< \brief (PM) APB Base Address */
#define PM_ADDR                       (0x400E0000UL) /**< \brief (PM) APB Base Address */
#define PM_INST_NUM       1                          /**< \brief (PM) Number of instances */
#define PM_INSTS          { PM }                     /**< \brief (PM) Instances List */

#define SCIF              ((Scif     *)0x400E0800UL) /**< \brief (SCIF) APB Base Address */
#define SCIF_ADDR                     (0x400E0800UL) /**< \brief (SCIF) APB Base Address */
#define SCIF_INST_NUM     1                          /**< \brief (SCIF) Number of instances */
#define SCIF_INSTS        { SCIF }                   /**< \brief (SCIF) Instances List */

#define SMAP              ((Smap     *)0x400A3000UL) /**< \brief (SMAP) APB Base Address */
#define SMAP_ADDR                     (0x400A3000UL) /**< \brief (SMAP) APB Base Address */
#define SMAP_INST_NUM     1                          /**< \brief (SMAP) Number of instances */
#define SMAP_INSTS        { SMAP }                   /**< \brief (SMAP) Instances List */

#define SPI               ((Spi      *)0x40008000UL) /**< \brief (SPI) APB Base Address */
#define SPI_ADDR                      (0x40008000UL) /**< \brief (SPI) APB Base Address */
#define SPI_INST_NUM      1                          /**< \brief (SPI) Number of instances */
#define SPI_INSTS         { SPI }                    /**< \brief (SPI) Instances List */

#define TC0               ((Tc       *)0x40010000UL) /**< \brief (TC0) APB Base Address */
#define TC0_ADDR                      (0x40010000UL) /**< \brief (TC0) APB Base Address */
#define TC1               ((Tc       *)0x40014000UL) /**< \brief (TC1) APB Base Address */
#define TC1_ADDR                      (0x40014000UL) /**< \brief (TC1) APB Base Address */
#define TC_INST_NUM       2                          /**< \brief (TC) Number of instances */
#define TC_INSTS          { TC0, TC1 }               /**< \brief (TC) Instances List */

#define TRNG              ((Trng     *)0x40068000UL) /**< \brief (TRNG) APB Base Address */
#define TRNG_ADDR                     (0x40068000UL) /**< \brief (TRNG) APB Base Address */
#define TRNG_INST_NUM     1                          /**< \brief (TRNG) Number of instances */
#define TRNG_INSTS        { TRNG }                   /**< \brief (TRNG) Instances List */

#define TWIM0             ((Twim     *)0x40018000UL) /**< \brief (TWIM0) APB Base Address */
#define TWIM0_ADDR                    (0x40018000UL) /**< \brief (TWIM0) APB Base Address */
#define TWIM1             ((Twim     *)0x4001C000UL) /**< \brief (TWIM1) APB Base Address */
#define TWIM1_ADDR                    (0x4001C000UL) /**< \brief (TWIM1) APB Base Address */
#define TWIM2             ((Twim     *)0x40078000UL) /**< \brief (TWIM2) APB Base Address */
#define TWIM2_ADDR                    (0x40078000UL) /**< \brief (TWIM2) APB Base Address */
#define TWIM3             ((Twim     *)0x4007C000UL) /**< \brief (TWIM3) APB Base Address */
#define TWIM3_ADDR                    (0x4007C000UL) /**< \brief (TWIM3) APB Base Address */
#define TWIM_INST_NUM     4                          /**< \brief (TWIM) Number of instances */
#define TWIM_INSTS        { TWIM0, TWIM1, TWIM2, TWIM3 } /**< \brief (TWIM) Instances List */

#define TWIS0             ((Twis     *)0x40018400UL) /**< \brief (TWIS0) APB Base Address */
#define TWIS0_ADDR                    (0x40018400UL) /**< \brief (TWIS0) APB Base Address */
#define TWIS1             ((Twis     *)0x4001C400UL) /**< \brief (TWIS1) APB Base Address */
#define TWIS1_ADDR                    (0x4001C400UL) /**< \brief (TWIS1) APB Base Address */
#define TWIS_INST_NUM     2                          /**< \brief (TWIS) Number of instances */
#define TWIS_INSTS        { TWIS0, TWIS1 }           /**< \brief (TWIS) Instances List */

#define USART0            ((Usart    *)0x40024000UL) /**< \brief (USART0) APB Base Address */
#define USART0_ADDR                   (0x40024000UL) /**< \brief (USART0) APB Base Address */
#define USART1            ((Usart    *)0x40028000UL) /**< \brief (USART1) APB Base Address */
#define USART1_ADDR                   (0x40028000UL) /**< \brief (USART1) APB Base Address */
#define USART2            ((Usart    *)0x4002C000UL) /**< \brief (USART2) APB Base Address */
#define USART2_ADDR                   (0x4002C000UL) /**< \brief (USART2) APB Base Address */
#define USART3            ((Usart    *)0x40030000UL) /**< \brief (USART3) APB Base Address */
#define USART3_ADDR                   (0x40030000UL) /**< \brief (USART3) APB Base Address */
#define USART_INST_NUM    4                          /**< \brief (USART) Number of instances */
#define USART_INSTS       { USART0, USART1, USART2, USART3 } /**< \brief (USART) Instances List */

#define USBC              ((Usbc     *)0x400A5000UL) /**< \brief (USBC) APB Base Address */
#define USBC_ADDR                     (0x400A5000UL) /**< \brief (USBC) APB Base Address */
#define USBC_INST_NUM     1                          /**< \brief (USBC) Number of instances */
#define USBC_INSTS        { USBC }                   /**< \brief (USBC) Instances List */

#define WDT               ((Wdt      *)0x400F0C00UL) /**< \brief (WDT) APB Base Address */
#define WDT_ADDR                      (0x400F0C00UL) /**< \brief (WDT) APB Base Address */
#define WDT_INST_NUM      1                          /**< \brief (WDT) Number of instances */
#define WDT_INSTS         { WDT }                    /**< \brief (WDT) Instances List */

#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/*@}*/

/* ************************************************************************** */
/**  GPIO DEFINITIONS FOR SAM4LC4C */
/* ************************************************************************** */
/** \defgroup SAM4LC4C_gpio GPIO Definitions */
/*@{*/

